{
  "name": "Benjamin Parsons",
  "contacts": [
    {
      "type": "email",
      "name": "benjamin.lee.parsons@gmail.com",
      "details": "benjamin.lee.parsons@gmail.com"
    },
    { "type": "phone", "name": "mobile", "details": "+65 9639 7646" }
  ],
  "links": [
    {
      "type": "link",
      "name": "linkedin",
      "details": "linkedin.com/in/benjamin-l-parsons"
    }
  ],
  "about": [
    {
      "section": "Brief",
      "text": "As an IT professional for over 20 years, I have gained experience across a number of different IT functions including Program & Project Management, Incident Management and Application Support. Over the past 14 years, I have been focused on Project Delivery as a Project Manager, then Scrum Master and currently a Platform Lead / Program Manager.",
      "order": 0
    },
    {
      "section": "Aspiration",
      "text": "Aspiration to take my strong technical knowledge, stakeholder management and overall IT experience, and apply it to designing and delivering Cloud Technologies as a Cloud Architect. Initially passing the Caltech Post Graduate Program in Cloud Computing and later passing the AWS Solutions Architect – Associate certification. Working towards securing the associated certifications for Microsoft Azure Architect Design.",
      "order": 1
    },
    {
      "section": "Current Role",
      "text": "In my current role, as a Platform Lead, my role is to lead 11 Agile squads to deliver Business value and best of breed solutions to the Bank of Singapore Users, including Clients, Relationship Managers and Operations Staff.",
      "order": 2
    },
    {
      "section": "Current Role",
      "text": "Driving the agile transformation agenda with other Scrum Masters to increase adoption within BOS, we provide guidance to other Project Manager cum Scrum Masters at the bank during the transition from traditional waterfall projects to the BOS agile framework.",
      "order": 2
    },
    {
      "section": "Current Role",
      "text": "Understanding the people and the technology required to drive change, I have built valuable relationships across the bank to facilitate delivery of Business benefits to Users and the Organisation. Building this network with stakeholders, Agile squads, other Change the Bank and Run the Bank teams, has been key to streamline change.",
      "order": 3
    },
    {
      "section": "Previous Roles",
      "text": "Prior to this position, my role was a Project Manager with 8 years+ experience in the Financial Markets domain delivering projects in the Front and Middle office space across within ANZ and earlier exposure in other Telecommunications and Technology companies.",
      "order": 4
    },
    {
      "section": "Previous Roles",
      "text": "My Project Management skills include managing projects end to end undertaking all aspects of delivery from investment case to Business transition and project closure. I have worked with Business stakeholders and delivery partners both internally and externally across Australia, Singapore, Hong Kong, India, Philippines and United Kingdom.",
      "order": 4
    }
  ],
  "skills": [
    {
      "title": "Core Skills",
      "skills": [
        "Strong Leadership skills",
        "Stakeholder Management",
        "Strong Communication & Team building skills",
        "Strong Technical understanding",
        "Strong Problem-solving skills",
        "Adaptability to change",
        "Infrastructure deployment",
        "Functional exposure: Markets Onboarding, Market Risk, Digital Delivery, OTC Reform, Wealth"
      ],
      "order": 0
    },
    {
      "title": "Agile Skills",
      "skills": [
        "Certified SCRUM Master PSM I",
        "Well respected across the squad, Product Owners and other stakeholders",
        "Works with Product Owners & SMEs to manage product backlog and align to product roadmap",
        "Facilitation of all ceremonies",
        "Collaborates with other squads, SCRUM Masters & Product Owners to align delivery",
        "Hybrid role of Scrum Master into PM space managing squad financials and resourcing",
        "Kanban training, Delivery at Scale"
      ],
      "order": 1
    },
    {
      "title": "PM Skills",
      "skills": [
        "Investment case development",
        "Project Initiation",
        "Stakeholder Management",
        "Project Planning & Scheduling",
        "Workshop Development",
        "Change & Impact Assessment",
        "Cost Management",
        "Resource & People Management",
        "Risk & Issue Management",
        "Release Management",
        "Business Transition"
      ],
      "order": 2
    },
    {
      "title": "Application / Other Skills",
      "skills": [
        "AWS, Microsoft Azure trained through Caltech Post Graduate Program in Cloud Computing",
        "Confluence, JIRA",
        "Advanced Microsoft Project & Visio, Excel, Word, PowerPoint",
        "General Technologies: In Memory Analysis cube, Connect Direct, Control-M, HPC Grid, MQ, Webservices",
        "CA Service Desk Manager",
        "Intermediate Coding Skills: ReactJS, Python, JavaScript, Python, VB Script"
      ],
      "order": 3
    }
  ],
  "experience": [
    {
      "start": "01-Jul-2023 ",
      "end": "",
      "current": true,
      "company": "Bank of Singapore",
      "position": "Platform Lead",
      "title": "Digital Agile Delivery",
      "project": "Leading the Digital Platform of 9 squads, we are delivering multiple digital products to serve Clients, Client Onboarding, Relationship Managers, and Operations Teams.",
      "role": "Promoted from Scrum Master to Platform Lead, my role consist of full oversight of the Digital squads, aligning with Product Owners, Business and Technical Stakeholders to continue delivering best of breed solutions to our user base.",
      "achievements": "",
      "order": 0
    },
    {
      "start": "01-Jun-2019 ",
      "end": "30-Jun-2023",
      "current": false,
      "company": "Bank of Singapore",
      "position": "SCRUM Master",
      "title": "Digital Agile Delivery",
      "project": "Payment, chat and Advisory functionality through the respective digital portals, including taking on taskforces for Data feed generation to support IAM Clients.",
      "role": "Hired as a Scrum Master in the early stages of the Agile transformation within BOS.  Worked initially to deliver a Secure Communication tool for B2C communication between RM and Clients as part of a Bank wide program.  Post the program, the squad continued to deliver incremental functionality with monthly releases.  The role, while hired as a SCRUM Master, included Project Management tasks including financial forecasting, budgeting / tracking and dependency management.  Involved closely with Product Owners and Stakeholders to increase awareness of Agile activities and drive the delivery of the product roadmap.  Post squad restructure, I took the role as Scrum Master for the Advisory squad, delivering an portal for Advisory and Post Sale notifications to be targeted and sent to respective clients.",
      "achievements": "Delivered the Secure Communication tool and RM initiated transfers.",
      "order": 1
    },
    {
      "start": "01-Jul-2018",
      "end": "30-Jan-2019",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Fixed Income Clearer move",
      "project": "The Bank of New York (BNYM) Clearer move was the migration of Fixed Income clearing functions to BNYM as the previous clearer was unable to align to ANZ strategic direction and support STP capability.",
      "role": "Project managed the delivery of the project managing in-house BA team, development team, testing and implementation teams from an existing design through to build, test and implementation / transition.",
      "achievements": "Delivered the functionality to enable BNYM as the clearing agent under tight time pressures within 5 months.",
      "order": 2
    },
    {
      "start": "01-Nov-2017",
      "end": "30-Aug-2018",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "eOnboarding Online Application",
      "project": "eOnboarding project scope was to build a new channel to apply for Markets products.  The Online Application form as a new entry point for Markets customers to apply for Markets Products.  The Online Application form then connected into existing Markets Onboarding Systems.",
      "role": "End to end project management.  From investment case development to Implementation and Transition. Managed BA's, Development team, Test and Release Teams.",
      "achievements": "Successfully delivered Phase 1 of the project scope and the investment case of Phase 2.  The project reduced 40% of wasted time on unsuitable customer applications, reduced FTE by removing manual keying and enabled STP into existing onboarding systems.  The project was delivered 30% under cost by working with teams across differing domains to utilise shared technology and functionality.",
      "order": 3
    },
    {
      "start": "01-Apr-2017",
      "end": "30-Jun-2018",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Document Storage Upgrade",
      "project": "DSU Project implemented the use of Filenet to the current GoldTier Markets Onboarding application to ensure the project met the standard security requirements for Customer Document Storage.",
      "role": "End to end project management from the development of the investment case through to implementation and transition.  Managed BA's, Delivery partners, Vendors delivery, Test and Release Teams.",
      "achievements": "Seamless delivery of the document storage solution to meet security requirements for document storage, setup the application for future growth, reduce risk on production hardware due to no longer requiring to store documentation on local servers and reduced storage costs being consolidated on shared servers.",
      "order": 4
    },
    {
      "start": "01-Nov-2016",
      "end": "01-May-2017",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Settlements Project",
      "project": "Scope of this project was to include FX Corp & Commercial counterparties onto the newly implemented Settlement engine to increase the STP settlements rate committed to the Australian Securities and Investment Commission.",
      "role": "Management of BA's, development team and delivery partners to elaborate requirements, consolidate a delivery plan and start development.",
      "achievements": "Delivery plan was completed with a well-defined resourcing and delivery approach, although due to funding cuts and competing priorities, the project was put on hold due and rescheduled to be delivered in the next financial year.",
      "order": 5
    },
    {
      "start": "01-Apr-2016",
      "end": "30-Oct-2016",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Perimeter Security Upgrade",
      "project": "Upgrade the stand-alone facilities server coming to end of life and set the ground work for a consolidated multi location Access system.",
      "role": "End to end project management starting with the requirement finalisation through to implementation, migration and transition.",
      "achievements": "Seamless delivery of shared application across numerous sites in Singapore and single location in Bangalore to enable access administration across numerous sites from any one location.",
      "order": 6
    },
    {
      "start": "01-Sep-2015",
      "end": "30-Sep-2016",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "eOnboarding Online Application",
      "project": "eOnboarding project scope was to build a new channel to apply for Markets products.  The Online Application form as a new entry point for Markets customers to apply for Markets Products.  The Online Application form then connected into existing Markets Onboarding Systems.",
      "role": "Develop investment case, requirement elicitation, engage delivery partners for cost/effort estimation and develop the integrated delivery plan.",
      "achievements": "Approval of investment case and completion of the delivery plan ready to execute.  Due to lack of funding the project was put on hold but packaged in readiness once funding was obtained.",
      "order": 7
    },
    {
      "start": "01-Oct-2014",
      "end": "30-Sep-2015",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Payments Clearing Integration",
      "project": "Implement the building blocks for Interbank Payment STP in the Vietnam hub.  This was the first step to move away from manual payment transfer and handling.",
      "role": "End to end project management post requirements gathering.  Working with infrastructure and application teams both locally and abroad.",
      "achievements": "Successful delivery of project and implementation of infrastructure and application components to manage large volumes of transactions daily.",
      "order": 8
    },
    {
      "start": "01-Sep-2014",
      "end": "30-Feb-2015",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Markets KYC application",
      "project": "Continued rollout of GoldTier, the Thomson Reuters built application to meet Onboarding, KYC, AML, OTC/Dodd Frank and FATCA requirements for Australia, UK, Hong Kong, and Singapore entities.",
      "role": "End to end Project Management, vendor management to deliver the application changes to cater for the differing policies and requirements.",
      "achievements": "Successful delivery of Hong Kong and Singapore policies overcoming application performance issues to ensure smooth delivery and no production impacts.",
      "order": 9
    },
    {
      "start": "01-May-2014",
      "end": "30-Oct-2014",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "SKY Project",
      "project": "Leveraging off the pricing grid setup in the Derivatives Valuation Rebuild project, this project developed the application components to facilitate the re-pricing of Derivatives incorporating CVA / FVA calculation.",
      "role": "Project management during infrastructure enablement to delivery and implementation of both infrastructure and application components.",
      "achievements": "Fast tracked delivery of infrastructure across London, Australia and Singapore to support the successful implementation of the pricing engine while adhering to the high implementation and change standards.  This meant large reduction in required capital due to more accurate pricing.",
      "order": 10
    },
    {
      "start": "01-Oct-2012",
      "end": "30-Apr-2014",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Over the Counter Reform",
      "project": "OTC Reform was to meet the regulatory requirements of the Dodd-Frank regulations.",
      "role": "Management of the delivery team to implementation of reporting engine to cater for the required reporting for multiple jurisdictions.  In addition, delivery of small to medium upstream / downstream components from delivery partners to build in extra functionality.",
      "achievements": "Successful delivery of reporting requirements for US, Hong Kong, Australia, Japan and Europe regulators.  This delivery meant ANZ was one of the first Australian banks to be Dodd-Frank compliant.  Huge time pressures and potential financial impacts meant teams needed to be very Agile and dynamic to quickly synthesise requirements from Business, Compliance and Legal teams to deliver in regular releases.",
      "order": 11
    },
    {
      "start": "01-Jul-2012",
      "end": "30-Feb-2013",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Derivatives Valuation Rebuild",
      "project": "Derivatives Valuation Rebuild came about due to the need to price trades more accurately with the use CVA and FVA and reduce capital required by ANZ.",
      "role": "Manage the end to end delivery and rapid deployment of large computing grids.",
      "achievements": "Delivery of 2 x 64 node computing grids within 3 months from ordering to stand up.  This grid enabled the application POC of the pricing engine pricing engine.",
      "order": 12
    },
    {
      "start": "01-Apr-2011",
      "end": "30-Oct-2012",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Technical Project Manager",
      "title": "Market Risk Reporting System",
      "project": "Deliver an in-house build Market Risk Reporting System to perform aggregation, Market Risk simulations and scenarios.",
      "role": "End to end project management from requirements elicitation to implementation and transition including infrastructure stand-up.",
      "achievements": "Successful roll-out in a phased manner based on risk types and simulation / scenario types.  This project removed a large number of uncontrolled and adhoc developed spreadsheets and consolidated all risk calculations in one system.  The system provided new functionality not previously available to manipulate the risk data many ways including slicing and dicing, graphical views, drill-down and report functionality. ",
      "order": 13
    },
    {
      "start": "01-Dec-2010",
      "end": "30-Apr-2011",
      "current": false,
      "company": "ANZ Singapore",
      "position": "Delivery and Implementation Manager",
      "title": "Murex Upgrade",
      "project": "Murex 2.11.36 was nearing end of support and required a substantial upgrade to 2.11.42 due to out of life support for the existing version and new functional requirements.",
      "role": "Managed the final build, co-ordinated the change/implementation requirements and implementation of the application and extended changes.",
      "achievements": "With help of the Project Manager, we managed to rescue this derailed implementation by taking stock of the current state of the project and implementation and working through the key issues to get to a point ready to implement.  While all through this change of stakeholders and delivery resources, we managed to get the project back on track and deliver the project with minimal delay.",
      "order": 14
    },
    {
      "start": "01-Aug-2010",
      "end": "30-Dec-2010",
      "current": false,
      "company": "ANZ Australia",
      "position": "Program Scheduler",
      "title": "Transformation Project",
      "project": "This large transformation project aimed to align 16 projects in differing stages of the project lifecycle to consolidate into one program and move to one technology platform.  This would reduce overall cost and setup a strategic platform for future delivery.",
      "role": "Consolidate individual project timelines and costs into an overall program timeline and cost estimation.",
      "achievements": "We delivered an investment case highlighting the benefits of the consolidation and made it available to be assessed for funding at the next investment slate steering group.",
      "order": 15
    },
    {
      "start": "01-Mar-2009",
      "end": "30-Jul-2010",
      "current": false,
      "company": "Telstra Australia",
      "position": "Delivery Manager",
      "title": "OSS Transformation Project",
      "project": "",
      "role": "Delivery Management of OSS infrastructure, Management/Co-ordination of Incidents & Changes, Infrastructure Delivery Scheduler",
      "achievements": "",
      "order": 16
    },
    {
      "start": "01-Jun-2007",
      "end": "30-Feb-2009",
      "current": false,
      "company": "Tracey Brunstrom & Hammond",
      "position": "Project Consultant",
      "title": "Telecommunication Transformation",
      "project": "",
      "role": "Project Change Request Analysis, Master Scheduler on a large Telecommunications implementation",
      "achievements": "",
      "order": 17
    },
    {
      "start": "01-Aug-2005",
      "end": "30-Jun-2007",
      "current": false,
      "company": "Hewlett Packard",
      "position": "Technical Support Team Lead",
      "title": "Technical Support",
      "project": "In Hewlett Packard, my roles changed ending as a Technical Lead on three major accounts supporting a customer base of over 3000 employees and 50 sites throughout Australia.",
      "role": "Technical Lead, Helpdesk Support, Duty Co-ordinator, User Administration",
      "achievements": "",
      "order": 18
    },
    {
      "start": "01-Jun-2005",
      "end": "30-Aug-2005",
      "current": false,
      "company": "MYOB Australia",
      "position": "Technical Support",
      "title": "Technical Support",
      "project": "In Hewlett Packard, my roles changed ending as a Technical Lead on three major accounts supporting a customer base of over 3000 employees and 50 sites throughout Australia.",
      "role": "Technical Support",
      "achievements": "",
      "order": 19
    },
    {
      "start": "01-Jul-2003",
      "end": "30-May-2005",
      "current": false,
      "company": "Web Developer",
      "position": "Web Developer",
      "title": "Web Developer",
      "project": "",
      "role": "",
      "achievements": "",
      "order": 20
    },
    {
      "start": "01-Apr-2001",
      "end": "30-Jul-2003",
      "current": false,
      "company": "Sensis (White & Yellow Pages)",
      "position": "Various Roles",
      "title": "Web Developer",
      "project": "",
      "role": "Domain Name Management, Macromatch Data Consultant, Electronic Customer Service Helpdesk Consultant, White & Yellow Pages Online Consultant, Database/Application Development",
      "achievements": "",
      "order": 21
    },
    {
      "start": "01-Dec-2000",
      "end": "30-Mar-2001",
      "current": false,
      "company": "Optus Cable & Wireless",
      "role": "Doing temporary work at Optus, I worked to automate order processing using MacOS.",
      "order": 101
    },
    {
      "start": "01-Nov-2000",
      "end": "30-Dec-2000",
      "current": false,
      "company": "Computershare Registry",
      "role": "As a Data Analyst, we processing mass data submission forms utilising OCR recognition.",
      "order": 102
    },
    {
      "start": "01-Nov-2000",
      "end": "30-Nov-2000",
      "current": false,
      "company": "Institution of Engineers",
      "role": "As a Client facing agent, I was undertaking event management for the upcoming Institute of Engineers company forum.",
      "order": 103
    },
    {
      "start": "01-Oct-1999",
      "end": "30-Oct-2000",
      "current": false,
      "company": "Beasley's Teahouse & Nursery",
      "role": "As a Customer service representative, I worked directly with customers to ensure a pleasant stay.",
      "order": 104
    },
    {
      "start": "01-Feb-1998",
      "end": "30-Feb-1999",
      "current": false,
      "company": "Pacific Access",
      "role": "I started as a Customer Consultant handling White Pages entries. Through extensive training I became an experienced and flexible member of the team.  Using my initiative I implemented mass processing and computer macros to improve productivity.  Recognising my computer knowledge, I was asked to participate in more involved projects such as Y2K testing and mass data manipulation.  After assisting with out-going calls to collect information for the new Yellow Pages Web Site, I was one of six selected to set up a role model office for other states to copy.  The duties involved loading numerous web page items onto the system.  I was also awarded Adecco's employee of the Month in May 1998.",
      "order": 105
    },
    {
      "start": "01-Oct-1996",
      "end": "30-Feb-1998",
      "current": false,
      "company": "Woolworths t/a Safeway Supermarkets",
      "role": "Starting as an Impact Manager, assessing the impact of consumables, I was quickly promoted to Night Store Manager, which involved running the store from 5pm, managing all aspects of Customer Service, Money handling and processing, Customer Complaints, Staff Management, Store Quality, Store Ordering / Re-stocking and all aspects of running a Grocery Store.",
      "order": 106
    },
    {
      "start": "01-Jun-1996",
      "end": "30-Aug-1996",
      "current": false,
      "company": "Cafe India",
      "role": "This was a short role by delivering Indian food around Melbourne's east suburbs.",
      "order": 107
    },
    {
      "start": "01-Jun-1995",
      "end": "30-Oct-1995",
      "current": false,
      "company": "Julians Lodge, Falls Creek",
      "role": "Fun, Fun, Fun!  What can I say ? Here my official job title  was waiter,  kitchenhand,  snow-shoveller, hydro-ceramic technician, room changer, fireplace setter... you name it I did it.  The lodge was quite small which provided close customer interaction.  I met some great people and had some amazing times.",
      "order": 108
    },
    {
      "start": "01-Oct-1992",
      "end": "30-Jun-1994",
      "current": false,
      "company": "Mc Donalds Australia",
      "role": "Starting at McDonalds early im my career, McDonalds really gave me my first glimpses of customer interaction and the running of a business.  I started with Front Counter Service, progressing to back of house, Crew Trainer then to stock handling and organising.  The Assistant Store Manager also taught me some basics of McDonalds management.",
      "order": 109
    },
    {
      "start": "01-Apr-1992",
      "end": "30-Nov-1994",
      "current": false,
      "company": "CCC Toyota Salvage",
      "role": "At the wrecking yard, I learned valuable skills pulling cars to bits and sometimes putting them back together correctly.  This was fun and messy work but a very enjoyable experience, giving me invaluable knowledge how to maintain and fix a car.  My job was to strip the parts off cars, organise stock and deliveries and deal with customers. I learnt a great deal of skills that I use to this day.",
      "order": 110
    }
  ],
  "education": [
    {
      "start": "01-Mar-2024",
      "end": "30-Mar-2027",
      "institute": "Amazon Web Services",
      "course": "AWS Certified Solutions Architect - Associate",
      "order": 0
    },
    {
      "start": "01-Jan-2024",
      "end": "30-Mar-2027",
      "institute": "Amazon Web Services",
      "course": "AWS Certified Cloud Practitioner",
      "order": 1
    },
    {
      "start": "01-Nov-2022",
      "end": "",
      "institute": "ICAgile",
      "course": "Delivery at Scale",
      "order": 2
    },
    {
      "start": "01-Apr-2019",
      "end": "",
      "institute": "Scrum.org",
      "course": "Professional Scrum Master™ I (PSM I)",
      "order": 0
    }
  ],
  "certifcations": [
    {
      "start": "01-Jul-2023",
      "end": "30-Dec-2023",
      "institute": "California Institute of Technology",
      "course": "Post Graduate Program in Cloud Computing",
      "order": 0
    },
    {
      "start": "01-Feb-1999",
      "end": "01-Oct-1999",
      "institute": "Swinburne Institute of Technical and Further Education",
      "course": "Certificate IV in Information Technology (Partially completed)",
      "order": 1
    },
    {
      "start": "01-Mar-1997",
      "end": "30-Sep-1997",
      "institute": "Northern Melbourne Institute of TAFE",
      "course": "Occupational Studies - Recreational Leadership and Fitness Instruction",
      "order": 2
    },
    {
      "start": "01-Feb-1988",
      "end": "30-Nov-1994",
      "institute": "Balwyn High School (1994)",
      "course": "V.C.E. Year 12",
      "order": 3
    }
  ]
}
